<!doctype html>
<html lang="fr">
<head>
<title>charte_mviewer</title>

<style>
ol {
  counter-reset: item;
}

ol > li {
  counter-increment: item;
}

ol ol > li {
  display: block;
}

ol > li {
  display: block;
}

ol > li:before {
  content: counters(item, ".") ". ";
}

ol ol > li:before {
  content: counters(item, ".") ". ";
  margin-left: -20px;
}

ul.indent {
  list-style-type: none;
}

h1{font-size: 2.5em;}
h2{font-size: 1.8em;}
h3{font-size: 1.5em;}
h4{font-size: 1.2em;}
code{font-family: RobotoMono;}
[data-color="black"], .color\:black  { color:black; }
[data-color="red"], .color\:red    { color:red; }
[data-color="green"], .color\:green  { color:green; }
[data-color="blue"], .color\:blue   { color:blue; }
[data-color="yellow"], .color\:yellow { color:yellow; }
[data-color="orange"], .color\:orange { color:orange; }
</style>
</head>
<body>
<h1>Charte de la communaut&#233; Mviewer</h1><p>Version 2024.11</p><h2>Qu&#8217;est-ce que mviewer ?&nbsp;</h2>Mviewer est un visualiseur cartographique multith&#233;matique accessible en ligne constitu&#233; d&#x27;un ensemble d&#x27;outils compl&#233;mentaires :<br><ul class="bullet"><li>Un module de visualisation &quot;Viewer&quot; propos&#233; &#224; l&#x27;utilisateur final</li><li>Le module &quot;Studio&quot; qui facilite la publication des cartes par les utilisateurs habilit&#233;s</li><li>Le module StoryMap qui permet de mettre en histoire des donn&#233;es</ul>Mviewer consomme des donn&#233;es servies par des plateformes (g&#233;ographiques) respectant des standards.<br>Initialement d&#xE9;velopp&#xE9; &#xE0; la R&#xE9;gion Bretagne en 2014, l&apos;outil mviewer b&#xE9;n&#xE9;ficie d&#xE9;sormais d&apos;une communaut&#xE9; d&#xE9;di&#xE9;e.<br><h2>Les principes</h2>mviewer est un outil accessible par tous et pour tous facilitant la cr&#233;ation et la diffusion de cartes th&#233;matiques &#224; partir de donn&#233;es disponibles.<br> Il est bas&#233; sur des principes :<ul class="bullet"><li>Le respect des r&#232;gles de l&#x27;Open Source : licence ouverte GPLv3, transparence...</li><li>Une installation simple</li><li>L&#8217;utilisation de technologies r&#233;pandues, simples, matures, fiables et maintenables</li><li>Un code source g&#233;n&#233;rique</li><li>Des fonctionnalit&#xE9;s activables via un param&#xE9;trage<</li><li>Un syst&#232;me d&#8217;extension permettant de conserver un c&#339;ur g&#233;n&#233;rique tout en apportant la possibilit&#233; d&#8217;adapter, de compl&#233;ter ou d&#8217;&#233;tendre le code source ou le comportement initial</li><li>La solution repose sur une communaut&#xE9; active</ul><h2>Communaut&#233; et gouvernance</h2><h3>La communaut&#233;</h3>Qui ? des utilisateurs, des d&#233;veloppeurs<br><br>Quoi ?<br><ul class="bullet"><li>Engagements<ul class="bullet"><li>Remont&#233;e des anomalies</li><li>Remont&#233;e des demandes d&#x27;&#233;volutions</li><li>Contributions au code source&nbsp; (pour ceux qui le peuvent) dans le respect des pratiques (cf. lien vers)</li><li>Contributions &#224; la documentation</li><li>Contributions &#224; la vie du projet (alimentation de la roadmap, animation, triage des issues, interaction avec les utilisateurs via matrix ou github, etc.)</ul><li>B&#233;n&#233;fices<ul class="bullet"><li>Accompagnement et support</li><li>P&#233;rennit&#233; de la solution</li><li>Participation aux &#233;v&#232;nements (rencontres annuelles, webinaires)</li><li>&#201;changer avec les utilisateurs et s&#x27;informer des nouveaut&#233;s et correctifs</ul></li></ul><h3>Le comit&#xE9; de pilotage</span></h3>Afin d&#8217;assurer le respect de cette charte, un comit&#233; de pilotage (PSC) mviewer a &#233;t&#233; cr&#233;&#233; en 2019. Ce comit&#233; couvre l&#8217;ensemble des solutions du d&#233;p&#244;t mviewer (mviewer, mviewerstudio, storymap).<br>Ce comit&#233; est compos&#233; d&#8217;individus fortement impliqu&#233;s &#224; titre individuel (individus ne repr&#233;sentant aucune structure) dans la vie du projet mviewer et dans le respect des principes &#233;nonc&#233;s pr&#233;c&#233;demment.<br><Le comit&#233; de pilotage se r&#233;unit tous les deux mois pour statuer sur les &#233;volutions du projet, l&#x27;animation de la communaut&#233;.<br>Les missions des membres du PSC :&#xA0;<br><ul class="bullet"><li>assister aux r&#233;unions du comit&#233; de pilotage</li><li>&#233;changer, &#233;mettre des avis...</li><li>participer au temps forts : rencontres mviewer, webinaires...</li><li>animer la communaut&#233; : support des utilisateur via le forum matrix, contributions au code... en fonction de ses comp&#233;tences, maintien du site internet</ul>Toute personne qui le souhaite et qui correspond &#224; la d&#233;finition d&#8217;un membre du comit&#233; de pilotage pr&#233;sent&#233;e pr&#233;c&#233;demment, peut se porter candidate pour int&#233;grer le comit&#233; de pilotage.<br>L&#x27;int&#233;gration d&#x27;un nouveau membre au PSC s&#x27;effectue suite &#224; un &#233;change pr&#233;alable durant lequel le candidat expose ses motivations et s&#x27;engage &#224; respecter les principes de la pr&#233;sente charte.<br>La d&#233;cision finale sera notifi&#233;e &#224; la personne candidate apr&#232;s un vote &#224; la majorit&#233; r&#233;alis&#233; par les membres d&#233;j&#224; en place.<br>Tout refus doit pouvoir &#234;tre expliqu&#233; en toute transparence et dans le respect des principes d&#233;crits dans cette charte.<br>Tout membre peut quitter d&#233;finitivement le PSC librement. Il ne peut toutefois d&#233;l&#233;guer sa place &#224; une autre personne qui devra se porter candidat selon le processus d&#233;crit pr&#233;c&#233;demment.&nbsp;<br>La place d&apos;un membre du PSC dont la participation au projet est jug&#xE9; insuffisante pourra &#xEA;tre remise en cause.<br><h3>Contribution au code source</h3>Toutes les contributions sont analys&#233;es par les membres de la communaut&#233; ou par toute personne souhaitant participer &#224; la vie du projet. Une contribution peut &#234;tre accept&#233;e ou refus&#233;e par les membres de la communaut&#233; disposant des droits n&#233;cessaires. Une demande de modification ou le refus d&#8217;une contribution doit &#234;tre motiv&#233; ou expliqu&#233; en toute transparence dans le plus grand respect des contributeurs.&nbsp;<br>Toute contribution le n&#233;cessitant doit &#234;tre document&#233;e dans la documentation de mviewer.<br>Le code doit respecter les bonnes pratiques d&#233;crites dans la documentation technique.<br>La contribution d&#x27;une personne n&#x27;est pas seulement technique et peut prendre diff&#233;rentes formes :<br><ul class="bullet"><li>Collaborations techniques (revues de code, contribution, correction d&#8217;anomalie, assistance technique &#224; la communaut&#233;, etc&#8230;)</li><li>Participation &#224; l&#8217;identification des besoins des utilisateurs mviewer</li><li>Contribution &#224; la documentation</li><li>Contribution &#224; l&#8217;identification d&#8217;anomalie ou d&#8217;&#233;volution</li><li>Animation de la communaut&#233; dans les diff&#233;rents canaux d&#8217;&#233;change (Site internet, Matrix, GitHub, Mail, &#233;v&#233;nements, webinaires)</li><li>Communication aupr&#232;s d&#8217;autres communaut&#233;s</li><li>Mise en place de version (Release)</li><li>Maintenance du site web</li><li>Etc&#8230;</ul><h2>Pour aller plus loin</h2>Le code source des outils mviewer est h&#233;berg&#233; sur GitHub et librement accessible :<br><a href="https&#x3a;&#x2F;&#x2F;github&#x2e;com&#x2F;mviewer" rel="noreferrer noopener">https:&#x2F;&#x2F;github.com&#x2F;mviewer</a><br>La documentation associ&#233;e est &#233;galement accessible librement :<br><a href="https&#x3a;&#x2F;&#x2F;mviewerdoc&#x2e;readthedocs&#x2e;io&#x2F;fr&#x2F;stable&#x2F;" rel="noreferrer noopener">https:&#x2F;&#x2F;mviewerdoc.readthedocs.io&#x2F;fr&#x2F;stable&#x2F;</a><br><a href="https&#x3a;&#x2F;&#x2F;mviewerstudio&#x2e;readthedocs&#x2e;io&#x2F;fr&#x2F;stable&#x2F;" rel="noreferrer noopener">https:&#x2F;&#x2F;mviewerstudio.readthedocs.io&#x2F;fr&#x2F;stable&#x2F;</a><br>Le site internet <a href="https&#x3a;&#x2F;&#x2F;mviewer&#x2e;github&#x2e;io" rel="noreferrer noopener">https:&#x2F;&#x2F;mviewer.github.io</a> permet la diffusion d&#x27;informations &#224; un plus large public.<br>Le salon matrix <a href="https&#x3a;&#x2F;&#x2F;app&#x2e;element&#x2e;io&#x2F;&#x23;&#x2F;room&#x2F;&#x23;mviewer&#x3a;matrix&#x2e;org" rel="noreferrer noopener">https:&#x2F;&#x2F;app.element.io&#x2F;#&#x2F;room&#x2F;#mviewer:matrix.org</a> permet d&#x27;int&#233;ragir avec la communaut&#233;.
</body>
</html>
